run/cokeCombustion/combustion_in_fracture_martrix/matrix_from_micro_ct/width=50/T573_Pe1e-2/constant/combustionControl
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionControl;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


targetResidualCokeFraction        12e-3;
involveGasProductionInNSEqn       true;


// ************************************************************************* //
